# Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [3]:
df1 = pd.DataFrame([[1,5,2,8],[8,5,4,7],[7,9,2,1],[5,7,2,6],[7,0,4,3]])

In [4]:
df1

   0  1  2  3
0  1  5  2  8
1  8  5  4  7
2  7  9  2  1
3  5  7  2  6
4  7  0  4  3

In [5]:
df1.head(3)

   0  1  2  3
0  1  5  2  8
1  8  5  4  7
2  7  9  2  1

In [6]:
df1.tail(4)

   0  1  2  3
1  8  5  4  7
2  7  9  2  1
3  5  7  2  6
4  7  0  4  3

# Slicing , Adding columns and other dataframes

In [7]:
df1

   0  1  2  3
0  1  5  2  8
1  8  5  4  7
2  7  9  2  1
3  5  7  2  6
4  7  0  4  3

In [8]:
df1.shape

(5, 4)

In [9]:
df1.iloc[0,1]   #accesing element

5

In [10]:
df1.iloc[0:2,0:2]

   0  1
0  1  5
1  8  5

In [11]:
df1.iloc[0:2,1:3]

   1  2
0  5  2
1  5  4

In [12]:
df1 = pd.DataFrame([[1,5,2,8],[8,5,4,7],[7,9,2,1],[5,7,2,6],[7,0,4,3]],columns=['A','B','C','D'])
df1

   A  B  C  D
0  1  5  2  8
1  8  5  4  7
2  7  9  2  1
3  5  7  2  6
4  7  0  4  3

# Read Csv files

In [13]:
df2 = pd.read_csv('data.csv')
df2

,Date,Open,High,Low,Close,Shares Traded,Turnover (Rs. Cr)
0,03-Mar-2021,15064.40,15273.15,14995.80,15245.60,544205583,34567.73
1,04-Mar-2021,15026.75,15202.35,14980.20,15080.75,534850447,36036.02
2,05-Mar-2021,14977.95,15092.35,14862.10,14938.10,640700362,37811.60
3,08-Mar-2021,15002.45,15111.15,14919.90,14956.20,580308065,29518.07
4,09-Mar-2021,15049.90,15126.85,14925.45,15098.40,675271251,38365.48
5,10-Mar-2021,15202.15,15218.45,15100.85,15174.80,404585756,25603.32

In [14]:
df2.head()

,Date,Open,High,Low,Close,Shares Traded,Turnover (Rs. Cr)
0,03-Mar-2021,15064.40,15273.15,14995.80,15245.60,544205583,34567.73
1,04-Mar-2021,15026.75,15202.35,14980.20,15080.75,534850447,36036.02
2,05-Mar-2021,14977.95,15092.35,14862.10,14938.10,640700362,37811.60
3,08-Mar-2021,15002.45,15111.15,14919.90,14956.20,580308065,29518.07
4,09-Mar-2021,15049.90,15126.85,14925.45,15098.40,675271251,38365.48

In [15]:
print(df2['Open'])

0    15064.40
1    15026.75
2    14977.95
3    15002.45
4    15049.90
5    15202.15
Name: Open, dtype: float64

In [16]:
print(df2['Open'].dtype)

float64

In [17]:
print(df2['Open'].astype('category'))

C:\Users\91932\anaconda3\lib\site-packages\pandas\io\formats\format.py:1405: FutureWarning: Index.ravel returning ndarray is deprecated; in a future version this will return a view on self.
  for val, m in zip(values.ravel(), mask.ravel())

0    15064.40
1    15026.75
2    14977.95
3    15002.45
4    15049.90
5    15202.15
Name: Open, dtype: category
Categories (6, float64): [14977.95, 15002.45, 15026.75, 15049.90, 15064.40, 15202.15]

In [ ]:
df2.loc[df[]]

# Write in Csv

In [21]:
df3 = pd.DataFrame([[1,5,2,8],[8,5,4,7],[7,9,2,1],[5,7,2,6],[7,0,4,3]])

In [22]:
df3.head()

   0  1  2  3
0  1  5  2  8
1  8  5  4  7
2  7  9  2  1
3  5  7  2  6
4  7  0  4  3

In [23]:
df3.to_csv('export.csv')

In [32]:
df3.to_csv('export.csv',index=False) #delete first col

# Dataframe merging

In [28]:
df4 = pd.DataFrame([[1,5,2],[8,5,4],[7,9,2]], columns = ['A','B','C'])

In [29]:
df4

   A  B  C
0  1  5  2
1  8  5  4
2  7  9  2

In [30]:
df5 = pd.DataFrame([[15,5,26],[81,5,48],[71,9,22]], columns = ['X','Y','Z'])

In [31]:
df5

    X  Y   Z
0  15  5  26
1  81  5  48
2  71  9  22

In [36]:
df6=pd.merge(df4,df5,right_on='Y', left_on='B')

In [37]:
df6

   A  B  C   X  Y   Z
0  1  5  2  15  5  26
1  1  5  2  81  5  48
2  8  5  4  15  5  26
3  8  5  4  81  5  48
4  7  9  2  71  9  22